// Place your settings in this file to overwrite the default settings
{
    // Editor

        // When opening a file, `editor.tabSize` and `editor.insertSpaces` will be detected based on the file contents.
        "editor.detectIndentation": true,

        // The number of spaces a tab is equal to. This setting is overriden based on the file contents when `editor.detectIndentation` is on.
        "editor.tabSize": 4,

        // Insert spaces when pressing Tab. This setting is overriden based on the file contents when `editor.detectIndentation` is on.
        "editor.insertSpaces": true,

        // Controls if the minimap is shown
        "editor.minimap.enabled": true,

        // Columns at which to show vertical rulers
        "editor.rulers": [ 120 ],

        // Controls whether the editor should render indent guides
        "editor.renderIndentGuides": true,

    // Workbench

        // Specifies the color theme used in the workbench.
        "workbench.colorTheme": "Visual Studio Dark",

    // Window

        // Controls if a window should restore to full screen mode if it was exited in full screen mode.
        "window.restoreFullscreen": true,

        // Adjust the zoom level of the window. The original size is 0 and each increment above (e.g. 1) or below (e.g. -1) represents zooming 20% larger or smaller. You can also enter decimals to adjust the zoom level with a finer granularity.
        "window.zoomLevel": 0,

    // Markdown

        // Disable the removal of trailing whitespaces, otherwise there are no newlines.
        "[markdown]": {
            "files.trimTrailingWhitespace": false,
        },

    // Files

        // Controls auto save of dirty files. Accepted values:  "off", "afterDelay", "onFocusChange" (editor loses focus), "onWindowChange" (window loses focus). If set to "afterDelay", you can configure the delay in "files.autoSaveDelay".
        "files.autoSave": "onFocusChange",

        // When enabled, insert a final new line at the end of the file when saving it.
        "files.insertFinalNewline": true,

          // When enabled, will trim all new lines after the final new line at the end of the file when saving it.
        "files.trimFinalNewlines": true,

        // When enabled, will trim trailing whitespace when saving a file.
        "files.trimTrailingWhitespace": true,

    // Integrated Terminal

        // Controls whether the terminal cursor blinks.
        "terminal.integrated.cursorBlinking": true,

        // The path of the shell that the terminal uses on Windows. When using shells shipped with Windows (cmd, PowerShell or Bash on Ubuntu).
        "terminal.integrated.shell.windows": "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe",

    // Code Settings Sync Configuration Settings

        // Set it to your GitHub Enterprise host if you want to use GHE.
        "sync.host": "",

        // Set it to your GitHub Enterprise api prefix if you want to use GHE. Normally '/api/v3'. Only used when host is set.
        "sync.pathPrefix": "",

        // Set it to true if you want to create or download from Anonymous Gist. Extension will not ask for GitHub token.
        "sync.anonymousGist": false,

        // Ask gist name upon creating. Helps you to identify the gist if you have multiple gists.
        "sync.askGistName": false,

        // Github GIST ID for Settings Sync.
        "sync.gist": "de31424382b355d4e2558d9a31ba8844",

        // Settings Sync last upload date. Set it as empty if you want to manully hit download.
        "sync.lastUpload": "2017-12-18T01:38:51.147Z",

        // Settings Sync last download date. Set it as empty if you want to manully hit download.
        "sync.lastDownload": "2017-10-27T15:00:58.470Z",

        // Set it to true if you want to download the settings even when you have latest settings.
        "sync.forceDownload": false,

        // Set it true to Auto Download the settings on code start. [Code Restart Required]
        "sync.autoDownload": true,

        // Set it true to Auto Upload on the settings change. [Code Restart Required]
        "sync.autoUpload": true,

        // When set to true, will show the result in status bar instead of summary page.
        "sync.quietSync": true,

    // PowerShell Configuration

        // Sets the codeformatting options to follow the given indent style in a way that is compatible with PowerShell syntax. For more information about the brace styles please refer to https://github.com/PoshCode/PowerShellPracticeAndStyle/issues/81.
        "powershell.codeFormatting.preset": "OTBS",

        // Shows the integrated console when the PowerShell extension is initialized.
        "powershell.integratedConsole.showOnStartup": false,

    // Terraform

        // Automatically format Terraform HCL files
        "terraform.formatOnSave": true,

    // Git

        // Whether auto fetching is enabled
        "git.autofetch": true,

        // Confirm before synchronizing git repositories
        "git.confirmSync": false,

        // Commit all changes when there are no staged changes.
        "git.enableSmartCommit": true,

}
